chenxx98/stm32EnvironmentalDetection/onenet.c
#include "onenet.h"

//单片机头文件
#include "stm32f10x.h"
//网络设备
#include "esp8266.h"
//协议文件
#include "mqttkit.h"
//硬件驱动
#include "usart.h"
#include "mq2.h"
#include "mq7.h"
#include "dht11.h"
#include "pwm.h"
#include "tft.h"
#include "lcd.h"
#include "utf8.h"
//C库
#include <string.h>
#include <stdio.h>

#define PROID		"390040" //产品ID
#define AUTH_INFO	"88888888"	//鉴权信息
#define DEVID		"656400693"	//设备ID

extern unsigned char esp8266_buf[128];
extern DHT11_Data_TypeDef DHT11_Data; //温湿度
extern float value_sr04;	//超声波距离
extern float value_light; 	//光照度
extern float value_mq2;		//烟雾浓度
extern float value_mq7;		//一氧化碳浓度
extern u8 status_sr501;		//人体红外检测到的值
extern u8 LED_Light;		//PWM灯光亮度
extern int max_mq7;			//一氧化碳浓度阈值

//==========================================================
//	函数名称：	OneNet_DevLink
//	函数功能：	与onenet创建连接
//	入口参数：	无
//	返回参数：	1-成功	0-失败
//	说明：		与onenet平台建立连接
//==========================================================
_Bool OneNet_DevLink(void)
{
	
	MQTT_PACKET_STRUCTURE mqttPacket = {NULL, 0, 0, 0};					//协议包

	unsigned char *dataPtr;
	
	_Bool status = 1;
	
	printf("OneNet_DevLink\r\nPROID: %s,	AUIF: %s,	DEVID:%s\r\n", PROID, AUTH_INFO, DEVID);
	
	if(MQTT_PacketConnect(PROID, AUTH_INFO, DEVID, 256, 0, MQTT_QOS_LEVEL0, NULL, NULL, 0, &mqttPacket) == 0)
	{
		ESP8266_SendData(mqttPacket._data, mqttPacket._len);			//上传平台
		
		dataPtr = ESP8266_GetIPD(250);									//等待平台响应
		if(dataPtr != NULL)
		{
			if(MQTT_UnPacketRecv(dataPtr) == MQTT_PKT_CONNACK)
			{
				switch(MQTT_UnPacketConnectAck(dataPtr))
				{
					case 0:printf("Tips:	连接成功\r\n");status = 0;break;
					
					case 1:printf("WARN:	连接失败：协议错误\r\n");break;
					case 2:printf("WARN:	连接失败：非法的clientid\r\n");break;
					case 3:printf("WARN:	连接失败：服务器失败\r\n");break;
					case 4:printf("WARN:	连接失败：用户名或密码错误\r\n");break;
					case 5:printf("WARN:	连接失败：非法链接(比如token非法)\r\n");break;
					
					default:printf("ERR:	连接失败：未知错误\r\n");break;
				}
			}
		}
		
		MQTT_DeleteBuffer(&mqttPacket);								//删包
	}
	else
		printf("WARN:	MQTT_PacketConnect Failed\r\n");
	
	return status;
	
}

unsigned char OneNet_FillBuf(char *buf)
{
	char text[32];
	
	memset(text, 0, sizeof(text));
	
	strcpy(buf, ",;");
		
	//光照
	memset(text, 0, sizeof(text));
	sprintf(text, "BH1750,%.1f;", value_light);
	strcat(buf, text);
	
	//烟雾
	memset(text, 0, sizeof(text));
	sprintf(text, "MQ2,%.1f;", value_mq2);
	strcat(buf, text);
	//一氧化碳
	memset(text, 0, sizeof(text));
	sprintf(text, "MQ7,%.1f;", value_mq7);
	strcat(buf, text);
	//湿度
	memset(text, 0, sizeof(text));
	sprintf(text, "DHT11_HUM,%d.%d;", DHT11_Data.humi_int,DHT11_Data.humi_deci);
	strcat(buf, text);
	//温度
	memset(text, 0, sizeof(text));
	sprintf(text, "DHT11_TEM,%d.%d;", DHT11_Data.temp_int,DHT11_Data.temp_deci);
	strcat(buf, text);
	//超声波测距
	memset(text, 0, sizeof(text));
	sprintf(text, "SR04,%.1fcm;", value_sr04);
	strcat(buf, text);
	
	//人体红外
	memset(text, 0, sizeof(text));
	if(status_sr501 != 0)
	{
		sprintf(text, "sr501,%s;", youren);
	}else
	{
		sprintf(text, "sr501,%s;", meiren);
	}
	strcat(buf, text);
	
	//灯光亮度
	memset(text, 0, sizeof(text));
	sprintf(text, "LED_Light,%d;", LED_Light);
	strcat(buf, text);
	
	//一氧化碳阈值
	memset(text, 0, sizeof(text));
	sprintf(text, "MAX_MQ7,%d;", max_mq7);
	strcat(buf, text);
	
	return strlen(buf);

}

//==========================================================
//	函数名称：	OneNet_SendData
//	函数功能：	上传数据到平台
//	入口参数：	type：发送数据的格式
//	返回参数：	无
//	说明：		
//==========================================================
void OneNet_SendData(void)
{
	
	MQTT_PACKET_STRUCTURE mqttPacket = {NULL, 0, 0, 0};												//协议包
	char buf[128];
	
	short body_len = 0, i = 0;
	
//	printf("Tips:	OneNet_SendData-MQTT\r\n");
	
	memset(buf, 0, sizeof(buf));
	
	body_len = OneNet_FillBuf(buf);																	//获取当前需要发送的数据流的总长度
	
	if(body_len)
	{
		if(MQTT_PacketSaveData(DEVID, body_len, NULL, 5, &mqttPacket) == 0)							//封包
		{
			for(; i < body_len; i++)
				mqttPacket._data[mqttPacket._len++] = buf[i];
			
			ESP8266_SendData(mqttPacket._data, mqttPacket._len);									//上传数据到平台
//			printf("Send %d Bytes\r\n", mqttPacket._len);
			
			MQTT_DeleteBuffer(&mqttPacket);															//删包
		}
		else
			printf("WARN:	EDP_NewBuffer Failed\r\n");
	}
	
}

//==========================================================
//	函数名称：	OneNet_RevPro
//	函数功能：	平台返回数据检测
//	入口参数：	dataPtr：平台返回的数据
//
//	返回参数：	无
//
//	说明：		
//==========================================================
void OneNet_RevPro(unsigned char *cmd)
{
	
	MQTT_PACKET_STRUCTURE mqttPacket = {NULL, 0, 0, 0};								//协议包
	
	char *req_payload = NULL;
	char *cmdid_topic = NULL;
	
	unsigned short req_len = 0;
	
	unsigned char type = 0;
	
	short result = 0;

	char *dataPtr = NULL;
	char numBuf[10];
	int num = 0;
	
	type = MQTT_UnPacketRecv(cmd);
	switch(type)
	{
		case MQTT_PKT_CMD:															//命令下发
			
			result = MQTT_UnPacketCmd(cmd, &cmdid_topic, &req_payload, &req_len);	//解出topic和消息体
			if(result == 0)
			{
				printf("cmdid: %s, req: %s, req_len: %d\r\n", cmdid_topic, req_payload, req_len);
				
				if(MQTT_PacketCmdResp(cmdid_topic, req_payload, &mqttPacket) == 0)	//命令回复组包
				{
					printf("Tips:	Send CmdResp\r\n");
					
					ESP8266_SendData(mqttPacket._data, mqttPacket._len);			//回复命令
					MQTT_DeleteBuffer(&mqttPacket);									//删包
				}
			}
		
		break;
			
		case MQTT_PKT_PUBACK:														//发送Publish消息，平台回复的Ack
		
			if(MQTT_UnPacketPublishAck(cmd) == 0)
//				printf("Tips:	MQTT Publish Send OK\r\n");
			
		break;
		
		default:
			result = -1;
		break;
	}
	
	ESP8266_Clear();									//清空缓存
	
	if(result == -1)
		return;
	
	dataPtr = strchr(req_payload, ':');					//搜索'}'

	if(dataPtr != NULL && result != -1)					//如果找到了
	{
		dataPtr++;
		
		while(*dataPtr >= '0' && *dataPtr <= '9')		//判断是否是下发的命令控制数据
		{
			numBuf[num++] = *dataPtr++;
		}
		numBuf[num] = 0;
		
		num = atoi((const char *)numBuf);				//转为数值形式
		
		if(strstr((char *)req_payload, "LED_Light"))		//搜索"redled"
		{
			LED_Light = num;
		}
		else if(strstr((char *)req_payload, "MAX_MQ7"))
		{
			max_mq7 = num;
		}
		
	}

	if(type == MQTT_PKT_CMD || type == MQTT_PKT_PUBLISH)
	{
		MQTT_FreeBuffer(cmdid_topic);
		MQTT_FreeBuffer(req_payload);
	}

}
